benchmarks/logs/2026-04-29_10-11-11/burst_post_bookmarks.txt
Running 10s test @ http://localhost:8080/bookmarks
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.51ms   18.86ms 143.09ms   74.37%
    Req/Sec   169.61    167.03     1.47k    92.00%
  Latency Distribution
     50%   23.77ms
     75%   33.51ms
     90%   46.70ms
     99%   97.75ms
  1698 requests in 10.06s, 782.75MB read
Requests/sec:    168.82
Transfer/sec:     77.82MB