benchmarks/logs/2026-04-29_10-11-11/soak_get_bookmarks.txt
Running 5m test @ http://localhost:8080/bookmarks
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.51ms    4.64ms  47.45ms   96.23%
    Req/Sec     5.89k   816.99     6.71k    86.90%
  Latency Distribution
     50%  520.00us
     75%    0.92ms
     90%    1.05ms
     99%   30.71ms
  1758446 requests in 5.00m, 18.55GB read
Requests/sec:   5859.50
Transfer/sec:     63.31MB